"""
python GC主要使用引用计数（reference counting）来跟踪和回收垃圾。
在引用计数的基础上，通过‘标记’-‘清除’（mark and sweep）解决容器
对象可能产生的循环引用问题，通过‘分代回收’（generation collection)
以空间换时间的方法提高垃圾回收效率。
1、引用计数：PyObject是每个对象必有的内容，其中ob_refcnt就是作为
引用计数。当一个对象有新的引用，它的ob_refcnt就会增加，当引用它的对象
被删除，它的ob_refcnt就会减少。引用计数为0时，该对象生命就结束。
2、标记-清除机制：先按需分配，等到没有空闲内存的时候从寄存器和程序栈上的
引用出发，遍历以对象为节点，以引用为边构成的图，把所有可以访问到的对象
打上标记，然后清扫一遍内存空间，把没有标记的对象释放出来。
3、分代技术：将系统中的所有内存块根据其存货时间划分为不同的集合，每个集合
就代表一个‘代’，垃圾收集频率随‘代’的存活时间的增加而减少，存活时间通常利用
经过几次垃圾回收来度量。python中默认定义了三代对象集合，索引数越大，
对象存活时间越长
示例：当某些内存块M经过了3次垃圾手机的清洗之后还存活时，我们就将内存块M划到
一个集合A中，而新分配的内存都划分到集合B中去。当垃圾收集开始工作时，大多数
情况都只对集合B进行垃圾回收，而对集合A进行垃圾回收要隔相当长的一段时间后才
进行，这就使得垃圾收集机制需要处理的内存少了，效率自然就提高了。在这个过程中，
集合B中的某些内存块由于存活时间长而会被转移到集合A中，当然，集合A中实际上也
存在一些垃圾，这些垃圾的回收会因为这种分代的机制被延迟。

"""